__author__ = 'm'
##################################################
# Эта программа выводит текст в обратном порядке #
##################################################

print("""
##################################################
# Эта программа выводит текст в обратном порядке #
##################################################
""")

text = input("Введите тескт:\n")

print("Введенный Вами текст в обратном порядке")
for i in range(-1, -len(text)-1, -1):
    print(text[i], end="")
print("\n")

input("Нажмите Enter для выхода...")